 DEFINE PROGRAM(GETSCORE) GROUP(SCORING)
        CONCURRENCY(THREADSAFE) DATALOCATION(ANY)

 DEFINE URIMAP(SCORESVR) GROUP(SCORING)
        USAGE(SERVER) SCHEME(HTTP)
        HOST(*) PATH(/scoring)
        TCPIPSERVICE(SCORETCP)
        TRANSACTION(CWBA) PROGRAM(GETSCORE)

 DEFINE TCPIPSERVICE(SCORETCP) GROUP(SCORING)
        HOST(ANY) PORTNUMBER()
        PROTOCOL(HTTP) TRANSACTION(CWXN)
        URM(DFHWBAAX)
	 
 DEFINE BUNDLE(JWTCBND) GROUP(SCORING)
        BUNDLEDIR(/)

