 DEFINE PROGRAM(GETQUOTE) GROUP(LOANS)
        CONCURRENCY(THREADSAFE) DATALOCATION(ANY)

 DEFINE TRANSACTION(QUOT) GROUP(LOANS)
        PROGRAM(GETQUOTE) TASKDATALOC(ANY)

 DEFINE URIMAP(SCORECLT) GROUP(LOANS)
        USAGE(CLIENT) SCHEME(HTTP)
        HOST() PORT() PATH(/scoring)

 DEFINE BUNDLE(JWTBBND) GROUP(LOANS)
        BUNDLEDIR(/)
